Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 224, 224, 8)       208
_________________________________________________________________
batch_normalization (BatchNo (None, 224, 224, 8)       896
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 8)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 16)      3216
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 112, 112, 16)      6416
_________________________________________________________________
batch_normalization_1 (Batch (None, 112, 112, 16)      64
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 112, 64)      9280
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 112, 112, 64)      36928
_________________________________________________________________
batch_normalization_2 (Batch (None, 112, 112, 64)      256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 64)        0
_________________________________________________________________
flatten (Flatten)            (None, 200704)            0
_________________________________________________________________
dense (Dense)                (None, 256)               51380480
_________________________________________________________________
batch_normalization_3 (Batch (None, 256)               1024
_________________________________________________________________
dropout (Dropout)            (None, 256)               0
_________________________________________________________________
dense_1 (Dense)              (None, 7)                 1799
=================================================================
Total params: 51,440,567
Trainable params: 51,439,447
Non-trainable params: 1,120
_________________________________________________________________
[INFO] model compiled.
[INFO] starting training...
Epoch 1/10
232/232 [==============================] - 1487s 6s/step - loss: 1.8403 - accuracy: 0.3347 - val_loss: 9.4020 - val_accuracy: 0.2414
Epoch 2/10
232/232 [==============================] - 1469s 6s/step - loss: 1.4355 - accuracy: 0.4535 - val_loss: 1.7978 - val_accuracy: 0.3483
Epoch 3/10
232/232 [==============================] - 1468s 6s/step - loss: 1.2398 - accuracy: 0.5342 - val_loss: 1.4122 - val_accuracy: 0.4647
Epoch 4/10
232/232 [==============================] - 1464s 6s/step - loss: 1.0646 - accuracy: 0.6080 - val_loss: 1.6748 - val_accuracy: 0.4492
Epoch 5/10
232/232 [==============================] - 1452s 6s/step - loss: 0.8448 - accuracy: 0.6968 - val_loss: 1.9261 - val_accuracy: 0.3934
[INFO] model trained and saved.